In [1]:
import pandas as pd

In [2]:
# Data olusturalim
d = {'sales': [100000,222000,1000000,522000,111111,222222,1111111,20000,75000,90000,1000000,10000], 
     'city': ['Tampa','Tampa','Orlando','Jacksonville','Miami','Jacksonville','Miami','Miami','Orlando','Orlando','Orlando','Orlando'], 
     'size': ['Small', 'Medium','Large','Large','Small','Medium','Large','Small','Medium','Medium','Medium','Small',]}

In [3]:
df = pd.DataFrame(data = d)

In [4]:
df.head(10)

     sales          city    size
0   100000         Tampa   Small
1   222000         Tampa  Medium
2  1000000       Orlando   Large
3   522000  Jacksonville   Large
4   111111         Miami   Small
5   222222  Jacksonville  Medium
6  1111111         Miami   Large
7    20000         Miami   Small
8    75000       Orlando  Medium
9    90000       Orlando  Medium

In [5]:
# siralama iceren bir data kolonu var (small/medium/Large)
df['size'].unique()

array(['Small', 'Medium', 'Large'], dtype=object)

In [6]:
# erisim rahat olsun diye tek bir dizi olarak tanimladik
sizes = ['Small', 'Medium', 'Large']

In [7]:
# kutuphanemizi cektik
from sklearn.preprocessing import OrdinalEncoder

In [8]:
enc = OrdinalEncoder(categories=[sizes])

In [9]:
enc.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [2.],
       [0.],
       [1.],
       [2.],
       [0.],
       [1.],
       [1.],
       [1.],
       [0.]])

In [10]:
df.head()

     sales          city    size
0   100000         Tampa   Small
1   222000         Tampa  Medium
2  1000000       Orlando   Large
3   522000  Jacksonville   Large
4   111111         Miami   Small

In [11]:
# dataframedeki size ibaresini fit ettiÄŸimiz deger ile degistirdik
df['size'] = enc.fit_transform(df[['size']])

In [12]:
df.head()

     sales          city  size
0   100000         Tampa   0.0
1   222000         Tampa   1.0
2  1000000       Orlando   2.0
3   522000  Jacksonville   2.0
4   111111         Miami   0.0